DataProcessors/РабочееМестоСотрудникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоСотрудникаСклада</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеСканированияШКЗаказаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеСканированияШКСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияВРабочемМестеРаботникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияВРабочемМестеРаботникаСклада</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУказатьСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РабочееМестоСотрудникаСклада/Forms/НастройкаДействий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// #14908
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьСтатусыСборки", ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыСборкиЗаказовПокупателей"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Действие,
	|	ДанныеСправочника.Наименование КАК ДействиеПредставление,
	|	ДанныеСправочника.Доступно КАК Доступно,
	|	ДанныеСправочника.ТребуетсяУказатьСотрудника КАК ТребуетсяУказатьСотрудника,
	|	ДанныеСправочника.ЭтапОтображения КАК ЭтапОтображения,
	|	ДанныеСправочника.ПояснениеДействия КАК ПояснениеДействия
	|ИЗ
	|	Справочник.ДействияВРабочемМестеРаботникаСклада КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ИспользоватьСтатусыСборки
	|				ТОГДА НЕ ДанныеСправочника.Ссылка В (ЗНАЧЕНИЕ(Справочник.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяИзменитьСборщика))
	|			ИНАЧЕ НЕ ДанныеСправочника.Ссылка В (ЗНАЧЕНИЕ(Справочник.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяСобранЧастично), ЗНАЧЕНИЕ(Справочник.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяСобранПолностью))
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСправочника.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НастройкаАРМСклада.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();	
	
	//#14908
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкаАРМСкладаТребуетсяУказатьСотрудника.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаАРМСклада.ЭтапОтображения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаАРМСкладаДоступноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкаАРМСклада.ТекущиеДанные;
	ЗаписатьРеквизитДействияАРМСклада(ТекущиеДанные.Действие, "Доступно", ТекущиеДанные.Доступно);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаАРМСкладаТребуетсяУказатьСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкаАРМСклада.ТекущиеДанные;
	ЗаписатьРеквизитДействияАРМСклада(ТекущиеДанные.Действие, "ТребуетсяУказатьСотрудника", ТекущиеДанные.ТребуетсяУказатьСотрудника);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаАРМСкладаЭтапОтображенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НастройкаАРМСклада.ТекущиеДанные;
	ЗаписатьРеквизитДействияАРМСклада(ТекущиеДанные.Действие, "ЭтапОтображения", ТекущиеДанные.ЭтапОтображения);
	
	Если ТекущиеДанные.ЭтапОтображения = ПредопределенноеЗначение("Перечисление.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника") Тогда
		ТекущиеДанные.ТребуетсяУказатьСотрудника = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьРеквизитДействияАРМСклада(ДействиеСсылка, ИмяРеквизита, ЗначениеРеквизита)
	
	СпрОбъект = ДействиеСсылка.ПолучитьОбъект();
	СпрОбъект[ИмяРеквизита] = ЗначениеРеквизита;
	Попытка
		СпрОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры
